---
kind: property
id: P:Autodesk.Revit.DB.View.AssociatedAssemblyInstanceId
zh: 视图
source: html/57f30f8b-8155-8916-4bef-b904e22b583e.htm
---
# Autodesk.Revit.DB.View.AssociatedAssemblyInstanceId Property

**中文**: 视图

The Id of the assembly instance that owns the assembly view.

## Syntax (C#)
```csharp
public ElementId AssociatedAssemblyInstanceId { get; }
```